m = [
    (1,0,0,1,1,0,0,1,1),
    (0,0,0,0,1,0,0,0,1),
    (1,0,1,1,1,0,1,0,0),
    (1,0,0,0,0,0,0,0,0),
    (1,0,1,0,0,0,0,1,0),
    (1,0,1,0,0,1,0,1,0),
    (1,0,1,1,1,0,0,0,0),
    (0,0,1,0,1,0,0,0,0),
    (1,1,0,0,1,0,0,1,0),
    (1,1,0,1,1,0,0,0,0),
    (0,0,1,0,1,1,0,0,1),
    (1,1,1,1,1,1,0,1,1),
    (1,1,1,0,0,0,1,0,0),
    (1,0,1,0,0,0,0,0,1),
    (1,0,1,0,1,1,0,0,1),
    (1,0,1,1,0,0,1,1,0),
    (1,0,1,0,1,1,0,1,0),
    (1,0,1,0,1,1,0,1,1),
    (1,1,1,0,1,0,0,0,0),
    (1,0,1,1,0,0,0,0,1)
]


# s = []

# for i in range(len(m)):
#     for j in range(i+1,len(m)):
#         b = True
#         for z in range(len(m[i])):
#             if m[i][z] != m[j][z]: b = False
#         if (b): s.append((i+1,j+1))

# print(s)

f = lambda i: "true" if i == 1 else "false"

for row in m:
    print('"": {')
    print(f'\t"Ձեր կերպարը արական սեռի ներկայացուցիչ է": {f(row[0])},')
    print(f'\t"Ձեր կերպարը հարուստ է": {f(row[1])},')
    print(f'\t"Ձեր կերպարը գյուղացի է": {f(row[2])},')
    print(f'\t"Ձեր կերպարը գլխավոր հերոսն է": {f(row[3])},')
    print(f'\t"Ձեր կերպարը ամուսնացած է եղել": {f(row[4])},')
    print(f'\t"Ձեր կերպարը մահացած է": {f(row[5])},')
    print(f'\t"Ստեղծագործության մեծ մասը անչափահաս է եղել": {f(row[6])},')
    print(f'\t"Ձեր կերպարը ունի ընկերներ": {f(row[7])},')
    print(f'\t"Ձեր կերպարը սիրահարված է": {f(row[8])}')
    print("},")
